## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.virtualservice_resource will be created
+   resource "kubernetes_manifest" "virtualservice_resource" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "argocd"
+               namespace = "kube-argocd"
            }
+           spec       = {
+               gateways = [
+                   "argocd-gateway",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       route = [
+                           {
+                               destination = {
+                                   host = "argocd-server"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "kube-argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "argocd-gateway",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = (known after apply)
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "argocd-server"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-rcxj5" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
